[
    {
        "file": "pulsar",
        "link": "https://jacobdcolby.github.io/pulsar/",
        "preview": "assets/projects/pulsar/1.png",
        "title": "Pulsar Product Page",
        "short-desc": "A sample web page showcasing Pulsar's X2 Wireless gaming mouse, featuring detailed product images and key features.",
        "long-desc": "This project involved designing a sample web page to showcase Pulsar's X2 Wireless gaming mouse. The page features detailed product images and highlights key features of the mouse, such as its wireless technology, ultra-lightweight design, and ergonomic shape. The goal was to create a visually appealing and informative layout that effectively promotes the product to potential customers.",
        "software": ["HTML", "CSS", "JavaScript", "Photoshop"],
        "year": "2024",
        "gallery": [
            "1.png",
            "2.png",
            "3.png",
            "4.png",
            "5.png"
        ]
    },
    {
        "file": "vct2023",
        "link": "null",
        "preview": "assets/projects/vct2023/1.png",
        "title": "Valorant Champions Tour 2023 Graphics",
        "short-desc": "Created graphics for upcoming and finished matches in Valorant's 2023 Championship Tour using Photoshop.",
        "long-desc": "For this project, I created graphics for upcoming and finished matches in Valorant's 2023 Championship Tour using Photoshop. The graphics were designed to be eye-catching and informative, featuring team logos, match schedules, and other relevant information. The goal was to create visuals that would engage fans and enhance their viewing experience of the tournament.",
        "software": ["Photoshop"],
        "year": "2023",
        "gallery": [
            "1.png",
            "2.png",
            "3.png",
            "4.png",
            "5.png",
            "6.png",
            "7.png",
            "8.png"
            
        ]
    },
    {
        "file": "logos",
        "link": "null",
        "preview": "assets/projects/logos/1.png",
        "title": "Logo Design",
        "short-desc": "A collection of sleek and modern logos designed for personal and company branding.",
        "long-desc": "This project collection features a series of sleek and modern logos designed for personal and company branding. Each logo represents a unique identity built to reflect the brand of the client.",
        "software": ["Illustrator"],
        "year": "2023",
        "gallery": [
            "1.png",
            "2.png",
            "3.png"
        ]
    },
    {
        "file": "portal-level",
        "link": "null",
        "preview": "assets/projects/portal-level/1.png",
        "title": "Portal 2 Level Design",
        "short-desc": "Created a playable level within Portal 2 that features an innovative use of portal mechanics, while offering players a challenging and engaging puzzle within the game.",
        "long-desc": "In this project, I created a playable level within Portal 2 that showcases innovative use of portal mechanics. The level offers players a challenging and engaging puzzle while demonstrating creative design and understanding of the game's mechanics. The goal was to create a memorable and enjoyable experience for players that balanced difficulty and time to complete the level.",
        "software": ["Valve Editor"],
        "year": "2023",
        "gallery": [
            "1.png",
            "2.png",
            "3.png",
            "4.png",
            "5.png",
            "6.png",
            "7.png",
            "8.png"
        ]
    },
    {
        "file": "quad-level",
        "link": "null",
        "preview": "assets/projects/quad-level/1.JPG",
        "title": "Isometric Level of Illinois State's Quad",
        "short-desc": "Created an isometric level design using the unique paths and angles of Illinois State's Quad, emphasizing its layout in a detailed and visually appealing style suitable for a virtual game.",
        "long-desc": "This project involved creating an isometric level design of Illinois State University's Quad, emphasizing its unique paths and angles in a detailed and visually appealing style. The design was created with the intention of being suitable for a virtual game, showcasing the campus layout in an interactive and engaging way. The goal was to capture the essence of the Quad's design while adding a creative twist for a virtual environment.",
        "software": ["Procreate"],
        "year": "2022",
        "gallery": [
            "1.JPG",
            "2.JPG",
            "3.JPG",
            "4.JPG",
            "5.JPG"
        ]
    }
]